## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 3 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecr will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr"  {
      ~ id      = "2104617068" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = "lambda:UpdateFunctionCode"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_appautoscaling_scheduled_action.api-5pm must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:239043911459:scheduledAction:f1239ef1-2f47-4775-af8b-a465c4b4f241:resource/lambda/function:api-lambda:5:scheduledActionName/api-5pm" -> (known after apply)
      ~ id                 = "api-5pm-lambda-function:api-lambda:5" -> (known after apply)
        name               = "api-5pm"
      ~ resource_id        = "function:api-lambda:5" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_scheduled_action.api-noon must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-noon" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:239043911459:scheduledAction:f1239ef1-2f47-4775-af8b-a465c4b4f241:resource/lambda/function:api-lambda:5:scheduledActionName/api-noon" -> (known after apply)
      ~ id                 = "api-noon-lambda-function:api-lambda:5" -> (known after apply)
        name               = "api-noon"
      ~ resource_id        = "function:api-lambda:5" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.api must be replaced
-/+ resource "aws_appautoscaling_target" "api" {
      ~ id                 = "function:api-lambda:5" -> (known after apply)
      ~ max_capacity       = 5 -> 10
      ~ resource_id        = "function:api-lambda:5" -> (known after apply) # forces replacement
      ~ role_arn           = "arn:aws:iam::239043911459:role/aws-service-role/lambda.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_LambdaConcurrency" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::239043911459:policy/notify-api"
        name      = "notify-api"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "ecr:GetDownloadUrlForlayer",
                            "ecr:BatchGetImage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                        Sid      = ""
                    },
                  ~ {
                      ~ Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "ses:SendRawEmail",
                          - "ses:SendEmail",
                          - "securityhub:BatchImportFindings",
                          - "s3:*",
                          - "mobiletargeting:*",
                        ] -> "s3:*"
                      ~ Resource = "*" -> ""
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "sns:Publish",
                          + "securityhub:BatchImportFindings",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id          = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
        name        = "ecr-api-lambda-access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = "lambda:UpdateFunctionCode"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:5" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "CSV_UPLOAD_BUCKET_NAME"         = "notification-canada-ca-staging-csv-upload" -> ""
                # (21 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda:5" -> (known after apply)
      ~ qualifier                         = "5" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>